 
/*-----------------------------------------------
  名稱：串口通信
  網站：www.doflye.net
  編寫：shifang
  日期：2009.5
  修改：無
  內容：連接好串口或者usb轉串口至電腦，下載該程序，打開電源
        打開串口調試程序，將波特率設置為9600，無奇偶校驗
        晶振11.0592MHz，發送和接收使用的格式相同，如都使用
        字符型格式，按復位重啟程序，可以看到接收到 UART test，技術論壇：www.doflye.net 請在發送區輸入任意信
		然後在發送區發送任意信息，接收區返回同樣信息，表明串口收發無誤
------------------------------------------------*/

#include<reg52.h> //包含頭文件，一般情況不需要改動，頭文件包含特殊功能寄存器的定義 
#include <string.h>                       
#define MAX 10
unsigned char buf[MAX];
unsigned char head = 0;


/*------------------------------------------------
                   函數聲明
------------------------------------------------*/
void SendStr(unsigned char *s);

/*------------------------------------------------
                    串口初始化
------------------------------------------------*/
void InitUART  (void)
{

    SCON  = 0x50;		        // SCON: 模式 1, 8-bit UART, 使能接收  
    TMOD |= 0x20;               // TMOD: timer 1, mode 2, 8-bit 重裝
    TH1   = 0xFD;               // TH1:  重裝值 9600 波特率 晶振 11.0592MHz  
    TR1   = 1;                  // TR1:  timer 1 打開                         
    EA    = 1;                  //打開總中斷
   // ES    = 1;                  //打開串口中斷
}  

       
/*------------------------------------------------
                    主函數
------------------------------------------------*/
void main (void)
{
unsigned long i;
InitUART();


SendStr("UART TEST");

ES    = 1;                  //打開串口中斷
while (1)                       
    {
 		if (head == 5)
		{
			buf[head] = '\0'; 
			head = 0;
			if ((strcmp(buf,"LEDON") == 0))	
				SendStr("REC_LED_ON");
			else if((strcmp(buf,"LEDOF") == 0))
				SendStr("REC_LED_OFF");	
				
		}

    }
}

/*------------------------------------------------
                    發送一個字節
------------------------------------------------*/
void SendByte(unsigned char dat)
{
 SBUF = dat;
 while(!TI);
      TI = 0;
}
/*------------------------------------------------
                    發送一個字符串
------------------------------------------------*/
void SendStr(unsigned char *s)
{
 while(*s!='\0')// \0 表示字符串結束標誌，通過檢測是否字符串末尾
  {
  SendByte(*s);
  s++;
  }
//  SendByte(0x0d);
//  SendByte(0x0a);
}
/*------------------------------------------------
                     串口中斷程序
------------------------------------------------*/
void UART_SER (void) interrupt 4 //串行中斷服務程序
{
    unsigned char Temp;          //定義臨時變量 
   
   if(RI)                        //判斷是接收中斷產生
     {
	  	RI=0;                      //標誌位清零
	  	Temp=SBUF;                 //讀入緩衝區的值
	//  P1=Temp;                   //把值輸出到P1口，用於觀察
    //  SBUF=Temp;                 //把接收到的值再發回電腦端
	  	buf[head] = Temp;
		head++;
		if (head == MAX) head = 0;
	 }
//   if(TI)                        //如果是發送標誌位，清零
//     TI=0;
} 


 
